# Название колонки в таблице `employees` для ID рабочего чата
EMPLOYEE_WORK_CHAT_ID_COLUMN = 'work_chat_id'

CITIES_TO_GROUPS = {
    "Владимир": 0, "Екатеринбург": -1003834359521, "Иваново": -1003409849410,
    "Казань": 0, "Кострома": -1003749359451, "Москва": -1003559739114,
    "Нижний Новгород": -1003731754411, "Нижний Тагил": -1003659046288,
    "Новосибирск": -1003760499721, "Омск": -1003742180272, "Пермь": -1003849401068,
    "Ростов-на-Дону": -1003837153559, "Рязань": 0, "Самара": -1003809968038,
    "Санкт-Петербург": -1003766727039, "Сочи": -1003822120037, "Сургут": -1003812933026,
    "Тверь": -1003743410590, "Тольятти": -1003836081700, "Тула": -1003770447273,
    "Тюмень": -1003814406575, "Уфа": -1003793984695, "Челябинск": -1003600530409,
    "Ярославль": -1003721184896
}

OPERATORS_TO_GROUPS = {
    "8075082040": -1003590702325,
    "8358119733": -1003842144942,
    "582035596": -1003832914431,
}

SECURITY_TO_GROUPS = {
    "582035596": -1003725082183,
    "7618917603": -1003864400045
}

MANAGERS_TO_GROUPS = {
    "582035596": -1003884189249,
}

STATUS_MAP = {
    "calc_new": "🆕 Новый расчет",
    "calc_requested": "📩 Запросили расчет",
    "calc_issued": "📤 Выдали расчет",
    "calc_accepted": "🤝 Клиент согласился с расчетом",
    "deal_processing": "⏳ Сделка в процессе",
    "deal_data_verification": "🔍 Идет проверка данных",
    "deal_data_verified": "✅ Данные проверены",
    "deal_dkp_uploading": "📑 Загрузка подписанного ДКП",
    "deal_verified": "🆗 Проверено",
    "deal_dkp_verification": "🧐 Проверка подписанного ДКП",
    "deal_signatures_verified": "🖋 Наличие подписей в ДКП проверено",
    "deal_success": "🎉 Успех",
    "deal_failed": "❌ Провал"
}